In [9]:
import numpy as np
import pandas as pd
arr1 = np.random.randint(0,100,(3,4))
df1 = pd.DataFrame(arr1, columns=["a","b","c","d"])
arr2 = np.random.randint(0,100,(3,4))
df2 = pd.DataFrame(arr2, columns=["e","f","g","h"])

In [11]:
print(df1)

    a   b   c   d
0  60  44   2  36
1   3  47  42  60
2  27  68   8  17

In [13]:
print(df2)

    e   f   g   h
0  25  27  45  29
1  32  93  16  12
2  54  50  19  84

In [15]:
pd.concat([df1,df2]) #concatenating with rows

      a     b     c     d     e     f     g     h
0  60.0  44.0   2.0  36.0   NaN   NaN   NaN   NaN
1   3.0  47.0  42.0  60.0   NaN   NaN   NaN   NaN
2  27.0  68.0   8.0  17.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  25.0  27.0  45.0  29.0
1   NaN   NaN   NaN   NaN  32.0  93.0  16.0  12.0
2   NaN   NaN   NaN   NaN  54.0  50.0  19.0  84.0

In [17]:
pd.concat([df1,df2],axis=1) #concatenating with columns

    a   b   c   d   e   f   g   h
0  60  44   2  36  25  27  45  29
1   3  47  42  60  32  93  16  12
2  27  68   8  17  54  50  19  84

In [23]:
df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'

In [35]:
import numpy as np
import pandas as pd
arr1 = np.random.randint(0,200,(8,5))
df1 = pd.DataFrame(arr1, columns=["a","b","c","d","e"])
arr2 = np.random.randint(0,200,(8,5))
df2 = pd.DataFrame(arr2, columns=["a","f","g","h","i"])

In [37]:
print(df1)

     a    b    c    d    e
0  162  172   51  151  114
1   35  121   78  153   34
2  116   88  165  116   47
3   64  117  156   94  135
4   25  102   93    7  160
5   11  190   57   10  150
6   41  184    9  197   98
7  175  166  163   50  112

In [39]:
print(df2)

     a    f    g    h    i
0  159   78  130   45   53
1   18    2   66   94   44
2  169   67   42  183  128
3   53  185   59  118   68
4  179  101   14   40    2
5   30   60    2   92   32
6  198  109   70  178   29
7   61   92  108  191   36

In [41]:
df1.merge(df2)

Empty DataFrame
Columns: [a, b, c, d, e, f, g, h, i]
Index: []

In [43]:
#Join operations

df1 = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
})

df2 = pd.DataFrame({
    'id': [3, 4, 5, 6],
    'age': [25, 30, 35, 40]
})
print(df1)
print(df2)

   id     name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
   id  age
0   3   25
1   4   30
2   5   35
3   6   40

In [45]:
# Inner join on 'id'
inner_join_df = pd.merge(df1, df2, on='id', how='inner')
print(inner_join_df)

   id     name  age
0   3  Charlie   25
1   4    David   30

In [47]:
# Left join on 'id'
left_join_df = pd.merge(df1, df2, on='id', how='left')
print(left_join_df)

   id     name   age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0

In [49]:
# Right join on 'id'
right_join_df = pd.merge(df1, df2, on='id', how='right')
print(right_join_df)

   id     name  age
0   3  Charlie   25
1   4    David   30
2   5      NaN   35
3   6      NaN   40

In [51]:
# Outer join on 'id'
outer_join_df = pd.merge(df1, df2, on='id', how='outer')
print(outer_join_df)

   id     name   age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      NaN  35.0
5   6      NaN  40.0

In [53]:
# Data Cleaning
data = {
    'id': [1, 2, 3, 4, 4, 6, 7, 8, 9, 9],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'David', 'Eve', 'Frank', np.nan, 'Grace', 'Grace'],
    'age': [25, 30, np.nan, 45, 45, 50, np.nan, 60, 55, 55],
    'salary': [50000, 60000, 70000, 80000,np.nan, 90000, 100000, 110000, np.nan, 110000],
    'department': ['HR', 'IT', 'Finance', 'HR', 'HR', 'IT', 'Finance', 'IT', 'HR', 'IT']
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
   id     name   age    salary department
0   1    Alice  25.0   50000.0         HR
1   2      Bob  30.0   60000.0         IT
2   3  Charlie   NaN   70000.0    Finance
3   4    David  45.0   80000.0         HR
4   4    David  45.0       NaN         HR
5   6      Eve  50.0   90000.0         IT
6   7    Frank   NaN  100000.0    Finance
7   8      NaN  60.0  110000.0         IT
8   9    Grace  55.0       NaN         HR
9   9    Grace  55.0  110000.0         IT

In [55]:
df.dropna()

   id   name   age    salary department
0   1  Alice  25.0   50000.0         HR
1   2    Bob  30.0   60000.0         IT
3   4  David  45.0   80000.0         HR
5   6    Eve  50.0   90000.0         IT
9   9  Grace  55.0  110000.0         IT

In [57]:
df.fillna(0)

   id     name   age    salary department
0   1    Alice  25.0   50000.0         HR
1   2      Bob  30.0   60000.0         IT
2   3  Charlie   0.0   70000.0    Finance
3   4    David  45.0   80000.0         HR
4   4    David  45.0       0.0         HR
5   6      Eve  50.0   90000.0         IT
6   7    Frank   0.0  100000.0    Finance
7   8        0  60.0  110000.0         IT
8   9    Grace  55.0       0.0         HR
9   9    Grace  55.0  110000.0         IT

In [59]:
df.fillna(df['salary'].mean())

   id     name      age    salary department
0   1    Alice     25.0   50000.0         HR
1   2      Bob     30.0   60000.0         IT
2   3  Charlie  83750.0   70000.0    Finance
3   4    David     45.0   80000.0         HR
4   4    David     45.0   83750.0         HR
5   6      Eve     50.0   90000.0         IT
6   7    Frank  83750.0  100000.0    Finance
7   8  83750.0     60.0  110000.0         IT
8   9    Grace     55.0   83750.0         HR
9   9    Grace     55.0  110000.0         IT

In [61]:
df.isnull()

      id   name    age  salary  department
0  False  False  False   False       False
1  False  False  False   False       False
2  False  False   True   False       False
3  False  False  False   False       False
4  False  False  False    True       False
5  False  False  False   False       False
6  False  False   True   False       False
7  False   True  False   False       False
8  False  False  False    True       False
9  False  False  False   False       False

In [63]:
df.notnull()

     id   name    age  salary  department
0  True   True   True    True        True
1  True   True   True    True        True
2  True   True  False    True        True
3  True   True   True    True        True
4  True   True   True   False        True
5  True   True   True    True        True
6  True   True  False    True        True
7  True  False   True    True        True
8  True   True   True   False        True
9  True   True   True    True        True

In [65]:
data = {
    'A': [1, 2, 3, 1, 2],
    'B': [4, 5, 6, 4, 5],
    'C': ['x', 'y', 'z', 'x', 'y']
}
df = pd.DataFrame(data)
print(df)

   A  B  C
0  1  4  x
1  2  5  y
2  3  6  z
3  1  4  x
4  2  5  y

In [67]:
df.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [69]:
df.drop_duplicates()

   A  B  C
0  1  4  x
1  2  5  y
2  3  6  z

In [71]:
df.duplicated(['B'])

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [73]:
df.drop_duplicates(['B'])

   A  B  C
0  1  4  x
1  2  5  y
2  3  6  z

In [75]:
df.replace(1,np.nan)

     A  B  C
0  NaN  4  x
1  2.0  5  y
2  3.0  6  z
3  NaN  4  x
4  2.0  5  y